driver-tests/bpelse/assign/AssignJbi/test/echoDoubleDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoDoubleDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoDoubleDataType">
    <string>1.051732E7</string>
    <normalizedString>1.051732E7</normalizedString>
    <token>1.051732E7</token>
    <base64Binary>1.051732E7</base64Binary>
    <hexBinary>1.051732E7</hexBinary>
    <integer>1.051732E7</integer>
    <positiveInteger>1.051732E7</positiveInteger>
    <negativeInteger>1.051732E7</negativeInteger>
    <nonNegativeInteger>1.051732E7</nonNegativeInteger>
    <nonPositiveInteger>1.051732E7</nonPositiveInteger>
    <long>1.051732E7</long>
    <unsignedLong>1.051732E7</unsignedLong>
    <int>1.051732E7</int>
    <unsignedInt>1.051732E7</unsignedInt>
    <short>1.051732E7</short>
    <unsignedShort>1.051732E7</unsignedShort>
    <byte>1.051732E7</byte>
    <unsignedByte>1.051732E7</unsignedByte>
    <decimal>1.051732E7</decimal>
    <float>1.051732E7</float>
    <double>1.051732E7</double>
    <boolean>1.051732E7</boolean>
    <duration>1.051732E7</duration>
    <dateTime>1.051732E7</dateTime>
    <date>1.051732E7</date>
    <time>1.051732E7</time>
    <gYear>1.051732E7</gYear>
    <gYearMonth>1.051732E7</gYearMonth>
    <gMonth>1.051732E7</gMonth>
    <gMonthDay>1.051732E7</gMonthDay>
    <gDay>1.051732E7</gDay>
    <Name>1.051732E7</Name>
    <QName>1.051732E7</QName>
    <NCName>1.051732E7</NCName>
    <anyURI>1.051732E7</anyURI>
    <language>1.051732E7</language>
    <ID>1.051732E7</ID>
    <IDREF>1.051732E7</IDREF>
    <IDREFS>1.051732E7</IDREFS>
    <ENTITY>1.051732E7</ENTITY>
    <ENTITIES>1.051732E7</ENTITIES>
    <NMTOKEN>1.051732E7</NMTOKEN>
    <NMTOKENS>1.051732E7</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
